# MultiReferenceAnnotationType Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultiReferenceAnnotationType Class
Members See Also
---
The type for MultiReferenceAnnotation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class MultiReferenceAnnotationType : ElementType
```

Visual Basic
---
```text
Public Class MultiReferenceAnnotationType _
	Inherits ElementType
```

Visual C++
---
```text
public ref class MultiReferenceAnnotationType : public ElementType
```

# Remarks
Multi-reference annotations can be used to label and dimension Rebar elements, and are labeled in the user interface as "Multi-rebar annotations". The type specifies the tag and dimension types to be used in the multi-reference annotation, as well as associated display settings.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB..::..MultiReferenceAnnotationType
# See Also
MultiReferenceAnnotationType Members
Autodesk.Revit.DB Namespace